[
  {
    "question": "1. Что такое информационная система? =А) Объект, способный осуществлять хранение, обработку или передачу информации. Б) Путь или средство, по которому передаются сигналы. В) Это путь для передачи данных от одной системы к другой. 2. Логический канал- А) Объект, способный осуществлять хранение, обработку или передачу информации. Б) Путь или средство, по которому передаются сигналы. =В) Это путь для передачи данных от одной системы к другой. 3. Канал связи – это А) Объект, способный осуществлять хранение, обработку или передачу информации. =Б) Путь или средство, по которому передаются сигналы. В) Это путь для передачи данных от одной системы к другой. 4. Совокупность правил, устанавливающих формат и процедуры обмена информацией между двумя или несколькими устройствами  это – А)Трафик Б)Метод доступа =В)Протокол 5. Поток сообщений в сети передачи данных это – =А)Трафик Б)Метод доступа В)Протокол 6. Способ определения того, какая из рабочих станций сможет следующей использовать канал связи и как управлять доступом к каналу связи (кабелю) это – А)Трафик =Б)Метод доступа В)Протокол 7. Топология – это … =А)Описание физических соединений в сети, указывающее какие рабочие станции могут связываться между собой. Б) Концепция, определяющая взаимосвязь, структуру и функции взаимодействия рабочих станций в сети. В) Концепция информационной сети, в которой ее ресурсы рассредоточены по всем системам 8. Архитектура – это А) Описание физических соединений в сети, указывающее какие рабочие станции могут связываться между собой. Б) Концепция информационной сети, в которой ее ресурсы рассредоточены по всем системам =В) Концепция, определяющая взаимосвязь, структуру и функции взаимодействия рабочих станций в сети. 9. Одноранговая архитектура – это =А) Концепция информационной сети, в которой ее ресурсы рассредоточены по всем системам Б) Описание физических соединений в сети, указывающее какие рабочие станции могут связываться между собой. В) Концепция, определяющая взаимосвязь, структуру и функции взаимодействия рабочих станций в сети. 10. Что из ниже перечисленного не является преимуществом одноранговой сети? А) они легки в установке и настройке; Б) отдельные ПК не зависят от выделенного сервера; В) пользователи в состоянии контролировать свои ресурсы; =Г) Сетевую безопасность одновременно можно применить только к одному ресурсу; Д) минимум оборудования и программного обеспечения; =Е) отсутствие централизованного администрирования; 11. Объект, предоставляющий сервис другим объектам сети по их запросам это – А) Клиент =Б) Сервер В) Интерфейсы пользователя 12. Рабочие станции, которые используют ресурсы сервера это – А)Интерфейс пользователя Б)Сервис =В)Клиент 13. Процедуры взаимодействия пользователя с системой или сетью это- А)Сервер =Б)Интерфейс пользователя В)Клиент 14. Файловый сервер а) отвечает за централизованное выделение ресурсов файлов; б) отвечает за централизованное выделение   ресурсов к базам данных; в) управляет действующими в сети службами электронной почты. 15. В чем заключается преимущество виртуального метода по сравнению с датаграммным методом коммутации пакетов? а)  в обеспечении упорядоченности пакетов, поступающих в адрес получателя; б)  в возможности одновременной передачи нескольких пакетов одного сообщения по альтернативным путям в сети; в) виртуальный метод коммутации пакетов не имеет преимущества по сравнению с датаграммным. 16. Терминал  – это а) конечный пользователь, источник запросов к сетевым ресурсам; б) держатель сетевых ресурсов; в) средство связи сетевых ресурсов. 17. Доступ к удаленным данным  (Remote Data Access –RDA) а) представляет собой процесс, выполняемый на компьютере-клиенте, отвечающий за интерфейс с пользователем; б) представляет собой процесс формирования SQL- запроса на стороне клиента, который обрабатывается на сервере, возвращая клиенту блоки данных; в) отвечает за централизованное выделение ресурсов к базам данных. 18. Дуплексный режим передачи сигнала  – это а) одновременная передача и прием сообщений; б) попеременная передача данных, когда источник  и приемник последовательно меняются местами; в) передача данных только в одном направлении. 19. Что такое пакет? а) любые данные, передаваемые по сети; б) блок информации, передаваемый как целое по сети от одного компьютера к другому; в) минимальная единица информации, передаваемая по сети. 20. MAN (Metropolitan Area Network) – это Раздел II: Семиуровневая модель OSI. 21 . Какой уровень управляет передачей данных по сети, обеспечивает подтверждение передачи? а) глобальная вычислительная сеть; б) региональная вычислительная сеть; в) локальная вычислительная сеть; =А)Сетевой Б)Канальный В)Транспортный 22. Какой уровень представляет собой битовые протоколы передачи информации? =А)Физический Б)Сеансовый В)Канальный 23. Какой уровень преобразует данные в общий формат для передачи по сети? А)Транспортный =Б)Представления В)Прикладной 24. Какой уровень представляет набор интерфейсов, позволяющий получить доступ к сетевым службам? =А)Прикладной Б)Сеансовый В)Транспортный 25. Поддержка взаимодействия между удаленными процессами это уровень – А)Сетевой =Б)Сеансовый В)Физический 26. Сколько уровней в модели OSI? =А)7 Б)9 В)12 27. Функцией какого уровня является выполнение нормального и срочного обмена данными между прикладными процессами? А)Транспортный =Б)Сеансовый В)Физический 28. Единицей информации канального уровня являются кадры. Кадры это- =А)  это логически организованная структура, в которую можно помещать данные. Б) это такое функционирование компонентов сети, которое создает взаимодействующим компонентам иллюзию прокладки между ними нужного тракта. В) это устройство, которое собирает информацию о топологии межсетевых соединений и на ее основании пересылает пакеты сетевого уровня в сеть назначения 29. Сколько видов протокола определяется на сетевом уровне? =А)2 Б)5 В)4 30. Логически организованная структура, в которую можно помещать данные это – А)Стек Б)Протокол =В)Кадр 31. Какой протокол стека OSI скрывает различия между сетевыми сервисами с установлением соединения и без установления соединения? А)Канальный Б)Физический =В)Транспортный 32. Адреса скольких уровней имеет каждый компьютер в сетях TCP/IP? Укажите уровень модели OSI,  который не подписан на рисунке. А)2 Б)4 =В)3 а) информационный; б) коммутационный; в) представительский. 34. Задача каждого уровня сетевой модели OSI а) предоставление услуг вышележащему уровню; б) предоставление услуг нижележащему уровню; в) предоставлению услуг любому уровню. 35. Укажите уровень модели OSI, который не подписан на рисунке. а) физический; б) коммутационный; в) информационный 36. Что означает термин OSI а) эталонная модель взаимодействия открытых систем; б) описание общей модели сети; в) оператор системы. 37. Технология АТМ включает в себя а) физический уровень, канальный уровень, уровень адаптации АТМ; б) физический уровень, уровень АТМ, уровень адаптации АТМ; в) физический уровень, сетевой уровень, уровень АТМ; 38. Укажите уровень модели OSI,  который не подписан на рисунке. а) информационный; б) коммутационный; в) сеансовый. 39. Укажите уровень модели OSI,  который не подписан на рисунке. Раздел III: Стандарты и стеки протоколов. а) прикладной; б) информационный; в) коммутационный. 40. Укажите протокол  передачи данных? =А)FTP Б)X.400 В)SNMP 41. Общий протокол управления информации это – А)FTAM =Б) CMIP В)FTP 42. Базовый протокол сетей NetWare – =А) NCP Б) TCP В) SPX 43. Протокол межсетевого обмена пакетами, предназначенный для адресации и маршрутизации пакетов в сетях Novell- А) IP Б) CLNP =В) IPX 44. Cетевой протокол без организации соединений – А) IP =Б) CLNP В) IPX 45. Протокол управления каналом передачи данных высокого уровня, для последовательных соединений - =А) HDLC Б) IEEE В) FDDI 46. Какой стандарт определяет метод доступа к шине с передачей маркера, прототип – ArcNet. А)802.9 Б) 802.12 =В) 802.4 47. Какой стандарт описывает рекомендации для региональных сетей. А)802.9 =Б) 802.6 В) 802.4 48. В каком стандарте рассмотрены вопросы обмена данными, шифрования, управления сетями и безопасности в сетевых архитектурах, совместимых с моделью OSI. А)802.9 Б) 802.6 =В) 802.10 49. На сколько уровней разбиваются стеки протоколов? =А) на 3 Б) на 5 В) на  7 50. На какие уровни разбиваются стеки протоколов? =А) Сетевые Б) Канальные В) Физические Г) Представительские =Д) Транспортные =Е) Прикладные Ж) Сеансовые 51. Какой протокол используется для управления сообщениями Интернета? =А) ICMP Б) FTP В) TFTP 52. Назовите протокол управления сообщениями Интернета? А) IGMP =Б) ICMP В) ARP 53. Протокол HTTP служит для: =А) передачи гипертекста Б) передачи файлов В) Запуска программы с удаленного компьютера 54. Какие протоколы являются потенциально более скоростными? а) бит-ориентированные протоколы; б) байт-ориентированные протоколы. 55. SMTP (Simple Mail Transfer Protocol) – это а) протокол пересылки файлов; б) протокол обслуживания электронной почты; в) протокол обмена гипертекстовой информацией. 56. Telnet – это а) протокол пересылки файлов; б) протокол обслуживания электронной почты; в) протокол эмуляции удаленного терминала. 57. Какой из перечисленных протоколов не является протоколом взаимодействия почтового клиента с почтовым сервером? Раздел IV: Топология вычислительной сети и методы доступа. а) UDP (User Datagram Protocol); б) IMAP (Interactive Mail Access Protocol); в) SMTP (Simple Mail Transfer Protocol). 58. Охарактеризуйте топологию Общая шина А) топология ЛВС, в которой все рабочие станции присоединены к центральному узлу который устанавливает, поддерживает и разрывает связи между рабочими станциями. Б) топология ЛВС, в которой каждая станция соединена с двумя другими станциями, образуя кольцо =В) тип сетевой топологии, в которой рабочие станции расположены вдоль одного участка кабеля, называемого сегментом 59. Охарактеризуйте топологию Кольцо А) топология ЛВС, в которой все рабочие станции присоединены к центральному узлу который устанавливает, поддерживает и разрывает связи между рабочими станциями. =Б) топология ЛВС, в которой каждая станция соединена с двумя другими станциями, образуя кольцо В) тип сетевой топологии, в которой рабочие станции расположены вдоль одного участка кабеля, называемого сегментом 60. Охарактеризовать топологию Звезда =А) топология ЛВС, в которой все рабочие станции присоединены к центральному узлу который устанавливает, поддерживает и разрывает связи между рабочими станциями. Б) топология ЛВС, в которой каждая станция соединена с двумя другими станциями, образуя кольцо В) тип сетевой топологии, в которой рабочие станции расположены вдоль одного участка кабеля, называемого сегментом 61. Перечислить наиболее используемые типы топологий? А) общая шина, кольцо, звезда Б) древовидная, ячеистая =В) общая шина, кольцо, звезда, древовидная, ячеистая 62. Устройство, которое собирает информацию о топологии межсетевых соединений и на ее основании пересылает пакеты сетевого уровня в сеть назначения это – А)Сервер =Б) Маршрутизатор В) Коммутатор 63. Способ соединения компьютеров в сеть это – =А)Топология Б)Протокол В)Адресация 64. Сколько выделяется основных  классов топологий? =А)2 Б)3 В)4 65. Способ определения того, какая из рабочих станций сможет следующей использовать ЛВС  это- А) Топология Ethernet Б)Рабочая станция =В)Метод доступа 66. Уникальная комбинация битов, позволяющая начать передачу данных это – =А)Маркер Б)Топология В)Метод доступа 67. Какой доступ основан на использовании специального устройства, называемого тактовым генератором? А)NDMA Б)FDMA =В) TDMA68. Какая из приведенных схем соединения компьютеров представляет замкнутую цепочку? А) Шина Б) Кольцо =В) Звезда 69. На рисунке изображена архитектура сети а) Token Ring; б) Ethernet; в) Arcnet. 70. На рисунке изображена топология сети а) Token Ring; б) Ethernet; в) Arcnet. 71. Gopher – это а) протокол обслуживания электронной почты; б) протокол обмена гипертекстовой информацией; в) распределенная иерархическая система хранения документов в INTERNET. 72. На рисунке изображена архитектура сети Раздел V: ЛВС и компоненты ЛВС. а) Token Ring; б) Ethernet; в) Arcnet. 73. Из каких основных аппаратных компонент состоит компьютерная сеть? А)5 =Б)3 В)2 74. К абонентским системам относятся? =А)компьютеры Б)концентраторы =В)принтеры =Г)сканеры Д)маршрутизаторы Е)мосты 75. К сетевому оборудованию относятся? А)кабели =Б)концентраторы =В)мосты Г)разъемы =Д)маршрутизаторы =Е)сетевые адаптеры 76. Совокупность компьютеров, каналов связи, сетевых адаптеров, работающих под управлением сетевой операционной системы и сетевого программного обеспечения это – А)ИС Б)ОС =В)ЛВС 77. Каждый ПК в ЛВС называется? =А)Рабочей станцией Б)файл-сервером В)сервером 78. Абонентская система, специализированная для решения определенных задач и использующая сетевые ресурсы это – А)Сервер =Б)Рабочая станция В)файл-сервер 79. Как называется устройство сопряжения для подключения ПК к сети? =А)Сетевой адаптер Б)Материнская плата В)Видео карта 80. Какой тип сервера подключает локальную сеть к сети Internet? А) Web–сервер =Б) Proxy серверВ)Универсальный сервер 81. Какой тип сервера предназначен для выполнения несложного набора различных задач обработки данных в локальной сети? =А)Универсальный сервер Б)Файловый сервер В)Сервер приложений 82. Для установления правил обмена информацией в сетях используется? =А)Протоколы Б)Сетевая карта В)Маршрутизатор 83. Локальная сеть – это… А)компьютерная сеть, расположенная по  всему миру Б)устройство для соединения компьютеров между собой =В)не большая компьютерная сеть в пределах одного помещения или предприятия 84. Выберите корректный IP-адрес компьютера в сети =А) 108.214.198.112Б)18.274.198.0В)1278.214.198 85. Определите номер компьютера в сети по IP 215.128.255.106 А)215.128.255.106 Б)128.255.106 =В)106 86. Из скольких бит состоит IP адрес? а) 16; б) 32; в) 48. 87. Какой вид сети представлен на рисунке? а) сеть с выделенным сервером; б) одноранговая сеть. 88. LAN (Local Area Network) – это Раздел VI: Физическая среда передачи данных. а) глобальная вычислительная сеть; б) региональная вычислительная сеть; в) локальная вычислительная сеть; 89. Длинномерное изделие электротехнической промышленности это – =А)Кабель связи Б)Линии связи В)Каналы связи 90. Какой вид кабеля используется для передачи данных на небольшие расстояния (до 100 м)? А)Коаксиальный =Б)Витая пара В)Оптоволоконный 91. Набор коммутационных элементов (кабелей, разъемов, коннекторов, кроссовых панелей и шкафов), а также методика их совместного использования это – А) Среда передачи данных Б) Пропускная способность канала =В) Структурированная кабельная система 92. Кабель, в котором изолированная пара проводников скручена с небольшим числом витков на единицу длины это – =А)Витая пара Б)Коаксиальный В)Оптоволоконный 93. С какой скоростью коаксиальные кабели могут передавать данные? А)10 Гбайт/с =Б)10 Мбит/с В)100 Мбит/с 94. Какой кабель обеспечивает высокую скорость передачи данных на большом расстоянии? =А)Оптоволоконный Б)Витая пара В)Коаксиальный 95. Что используется в оптоволоконном кабеле для передачи сигналов? А)Воздух Б)Звук =В)Свет 96. Какой кабель обеспечивает скорость передачи данных до 10 Мбит/с? =А) коаксиальный Б) витая параВ) оптоволокно 97. Максимальная скорость передачи информации в компьютерной локальной сети (на основе кабеля витая пара) А)100 Кбайт/сБ)100 Кбит/сВ)100 Мбит/с 98. Какой из способов подключения к Интернет обеспечивает наибольшие возможности для доступа к информационным ресурсам? а) удаленный доступ по коммутируемому телефонному каналу; б) постоянное соединение по выделенному телефонному каналу; в) постоянное соединение по оптоволоконному каналу. 99. Какой кабель изображен на рисунке? а) экранированная витая пара; б) неэкранированная витая пара; в) коаксиальный кабель. 100. Какой кабель изображен на рисунке? а) экранированная витая пара; б) неэкранированная витая пара; в) коаксиальный кабель. 101. Какой кабель изображен на рисунке? Раздел VII: Сетевые операционные системы. а) экранированная витая пара; б) неэкранированная витая пара; в) коаксиальный кабель. 102. Сетевое программное обеспечение, которое принимает запросы ввода/вывода для удаленных файлов, именованных каналов или почтовых слотов и затем переназначает их сетевым сервисам другого компьютера это – =А) Редиректор Б)Клиентское ПО В) Распределитель 103. Сети отделов А) соединяют несколько сетей отделов внутри отдельного здания или одной территории предприятия Б) объединяют все компьютеры всех территорий отдельного предприятия. =В) используются небольшой группой сотрудников, решающих общие задачи. 104. Сети кампусов =А) соединяют несколько сетей отделов внутри отдельного здания или одной территории предприятия Б) объединяют все компьютеры всех территорий отдельного предприятия. В) используются небольшой группой сотрудников, решающих общие задачи. 105. Сети предприятия (корпоративные сети) А) соединяют несколько сетей отделов внутри отдельного здания или одной территории предприятия =Б) объединяют все компьютеры всех территорий отдельного предприятия. В) используются небольшой группой сотрудников, решающих общие задачи. 106. Управление процессами и нитями – это функция… А) отображения практически неограниченной виртуальной памяти процессов в физическую оперативную память компьютера, которая имеет ограниченные размеры. =Б) создания, завершения и отслеживания существующих процессов и нитей (процессов, выполняемых на общей виртуальной памяти). В) реализующая абстракцию файловой системы, иерархии каталогов и файлов. Файловые системы ОС UNIX поддерживают несколько типов файлов. 107. Управление памятью – это функция =А) отображения практически неограниченной виртуальной памяти процессов в физическую оперативную память компьютера, которая имеет ограниченные размеры. Б) создания, завершения и отслеживания существующих процессов и нитей (процессов, выполняемых на общей виртуальной памяти). В) реализующая абстракцию файловой системы, иерархии каталогов и файлов. Файловые системы ОС UNIX поддерживают несколько типов файлов. 108. Что такое программный интерфейс? Раздел VIII: Требования, предъявляемые к сетям. А) функция отображения практически неограниченной виртуальной памяти процессов в физическую оперативную память компьютера, которая имеет ограниченные размеры. =Б) функция, обеспечивающая доступ к возможностям ядра со стороны пользовательских процессов на основе механизма системных вызовов, оформленных в виде библиотеки функций. В) функция запуска и раскрутки. 109. Свойство вычислительной системы, которое обеспечивает ей как логической машине возможность продолжения действий, заданных программой, после возникновения неисправностей это- А) Производительность Б) Прозрачность =В) Отказоустойчивость 110. Какой канал передачи информации как правило используется для соединения двух серверов? А)Кросс кабель Б)Витая параВ)Оптоволокно 111. Компьютер, подключенный к Интернету, обязательно должен иметь Раздел IX: Сетевое оборудование. А) Web-сайт Б) установленный Web - сервер =В)IP-адрес 112. Концентратор – это… А)устройство для соединения компьютеров через телефонную линию =Б)Устройство для организации работы локальной сети В)способ подключения двух компьютеров 113. Гипертекст – это: =А)Структурированный текст, в котором могут быть переходы по выделенным словам на другие документы Б)Текст, в котором используется шрифт крупного размера В)Текст, набранный на компьютере 114. Модем передающий информацию со скоростью 28 800 бит/с, за 1 секунду сможет передать: =А) Две страницы текста (3600 байт) Б)Рисунок (36 Кбайт) В)Аудио файл (360 Кбайт) 115. Глобальная сеть – это … А)Два компьютера находящиеся на огромном расстоянии и соединенные между собой каналами передачи информации =Б) Компьютерная сеть, использующая средства связи дальнего действия. В)Несколько компьютеров связанных между собой канатами передачи информации 116. На каком уровне сетевой модели OSI используется шлюз? А) Физическом, канальном, сетевомБ) Прикладном, сеансовом, транспортномВ) Сеансовом, представительском и прикладном 117. Ретрансляционная система, обеспечивающая взаимодействие информационных сетей – это … =А) ШлюзБ)ДоменВ)Адаптер 118. Для чего предназначена коммуникационная сеть? =А) предназначена для передачи данных, также она выполняет задачи, связанные с преобразованием данных Б) предназначена для хранения информации и состоит из информационных систем 119. Для чего предназначена информационная сеть? А) предназначена для передачи данных, также она выполняет задачи, связанные с преобразованием данных Б) предназначена для хранения информации и состоит из информационных систем 120. Устройство, которое передает полученный сигнал на все компьютеры в сети называется =А) Хаб Б) Свитч В) Репитер 121. Какие функции реализует транспортный уровень модели OSI =А) контроль ошибок Б) идентификацию dns В) маршрутизацию и коммутацию данных 122. Что произойдет с сетью, если в сети будут два компьютера с одним и тем же ip адресом А) Сеть не будет работать =Б) Сеть будет работать 123. Устройство, производящее преобразование аналоговых сигналов в цифровые и обратно, называется: А) сетевая карта =Б) модем В) процессор 124. WWW - это =А) World Wide Web Б) World Web Wide В) Wide World Web 125. Какие топологии используются в глобальных сетях? А) иерархическая Б) шина =В) кольцо 126. Какой значок на рабочем столе предназначен для работы с локальной сетью? А) Мой компьютер Б) Мои документы =В) Сетевое окружение 127. Для хранения файлов, предназначенных для общего доступа пользователей сети, используется: А) хост-компьютер =Б) файл-сервер В) клиент-сервер 128. Какое устройство изображено на рисунке? а) мост; б) маршрутизатор; в) концентратор. 129. Какое устройство изображено на рисунке? а) маршрутизатор; б) концентратор; в) шлюз. 130. Хост – это а) конечный пользователь, источник запросов к сетевым ресурсам; б) держатель сетевых ресурсов; в) средство связи сетевых ресурсов. 131. Коллизия – это а) метод поочередной передачи данных; б) метод одновременной передачи данных; в) столкновение, попытка одновременной передачи данных. 132. Соединение сегментов локальной сети является функцией? а) маршрутизатора; б) моста; в) концентратора. 133. Что означает термин «датаграмма»? а) самостоятельный пакет, движущийся по сети независимо от других пакетов; б) служебный пакет запроса на установление виртуального канала, связывающего станцию-инициатор с вызываемой станцией; в) любой пакет, движущийся по сети. 134. На рисунке приведены уровни, на которых работают мосты,  коммутаторы и  маршрутизаторы. Укажите устройство, которое работает на сетевом уровне. а) шлюз; б) маршрутизатор; в) мост. 135. Какой вид сети представлен на рисунке? а) сеть с выделенным сервером; б) одноранговая сеть. 136. Какое устройство изображено на рисунке? а) сетевой адаптер; б) концентратор; в) коммутатор. 137. Приемник  – это а) устройство, принимающее сигналы; б) устройство, являющееся источником данных; в) любое устройство в сети. 138. Коммутатор – это а) устройство, выполняющее функцию сопряжения ЭВМ с несколькими каналами связи; б) многопортовое устройство, обеспечивающее высокоскоростную коммутацию пакетов между портами; в) устройство, коммутирующее несколько каналов связи на один путем частотного разделения. 139. Домен – это а) часть адреса, определяющая адрес компьютера пользователя в сети; б) название программы, для осуществления связи между компьютерами; в) название устройства, осуществляющего связь между компьютерами. 140. Мультиплексор – это а) устройство, коммутирующее несколько каналов связи на один путем частотного разделения; б) устройство, выполняющее функцию сопряжения ЭВМ с одним каналом связи; в) устройство, выполняющее функцию сопряжения ЭВМ с несколькими каналами связи. 141. Какие строки информации может выводить на экран команда show interfaces serial? а) System image file is \"c4500-j-mz\" б) Serial1 is up, line protocol is up в) DECNET routing is enabled г) IOS(tm) 4500 Software (C4500-J-M), Experimental Version 11.2 142. Есть подозрение, что один из маршрутизаторов в сети посылает плохую маршрутную информацию. Какую команду можно использовать для проверки? а) Router# show ip protocol б) Router(config)# show ip protocol в) Router> show ip protocol г) Router(config-router)# show ip protocol 143. Что из приведенного ниже наилучшим образом описывает функцию уровня представлений? а) Он обеспечивает электрические, механические, процедурные и функциональные средства для активизации и поддержания канала связи между системами б) Он обеспечивает форматирование кода и представление данных в) Он обрабатывает уведомления об ошибках, учитывает топологию сети и управляет потоком данных г) Он предоставляет сетевые услуги пользовательским прикладным программам 144. Команда show access-list используется для того, чтобы: а) просмотреть директивы списка управления доступом б) просмотреть группировку списков управления доступом в) наблюдать за отладкой установки списков управления доступом г) просмотреть, установлены ли списки управления доступом 145. Какова цель ревизии средств защиты сети? а) Определение состава аппаратно-программного комплекса, требующегося для обеспечения защиты сети б) Согласование требований по защите сети со строительными нормами и нормами секретности в) Выяснение способности сети гарантировать целостность данных г) Оценка способностей клиентов пользоваться сетевым оборудованием и программным обеспечением 146. Какая функция позволяет маршрутизаторам оценивать имеющиеся маршруты к пункту назначения и устанавливать предпочтительный способ обработки пакетов? а) Функция компоновки данных б) Интерфейсный протокол SDLC в) Функция определения пути г) Протокол Frame Relay 147. Что из приведенного ниже правильно описывает процедуру начальной установки на маршрутизаторе глобальных параметров и параметров интерфейсов? а) Значения параметров по умолчанию указываются в строке каждого запроса в квадратных скобках б) Можно, но этого жестко не требуется, установить enable secret-пароль в) Для каждого установленного интерфейса необходимо предоставить ответы на ряд вопросов г) Должно быть установлено имя маршрутизатора 148. Какие протоколы использует протокол UDP для обеспечения надежности? а) Протоколы управления передачей б) Протоколы уровня приложений в) Протоколы сетевого уровня г) Межсетевые протоколы 149. Какое из описаний сигнала является наилучшим? а) Преобразование данных б) Официально установленные правила и процедуры в) Электрические импульсы, представляющие данные г) Усиление данных 150. Что произойдет, если набрать команду show ? в командной строке? а) Будет показан перечень подкоманд, которые могут применяться совместно с командой show б) Будет показан список пользователей, работающих в данный момент с маршрутизатором в) Будет показана последняя таблица г) Будут показаны список всех активных соединений и их статус 151. Для чего необходимо определять размер файла образа ОС IOS на TFTP-сервере перед пересылкой его в маршрутизатор? а) Для завершения операции пересылки протокола TFTP б) Чтобы проверить достаточность пространства во флэш-памяти для его сохранения в) Для верификации файла на предмет пригодности версии ОС IOS для данного маршрутизатора г) Для определения времени выгрузки файла и, таким образом, для оценки объема времени, в течение которого маршрутизатор не будет выполнять свою основную функцию 152. Какое из описаний топологии «расширенная звезда» является наилучшим? а) Топология ЛВС, в которой центральные точки сети соединяются с общим центральным коммутатором линейными связи б) Топология ЛВС, в которой центральный концентратор посредством вертикальной кабельной системы подключается к другим концентраторам, зависящим от него в) Топология ЛВС, при которой конечные точки сети соединяются с общим центральным коммутатором двухточечными связями г) Топология ЛВС, при которой переданные данные проходят всю длину среды передачи данных и принимаются всеми другими станциями 153. Какую из приведенных ниже команд следует использовать для того, чтобы выяснить, установлены ли на данном интерфейсе списки управления доступом? а) show ip network б) show ip protocols в) show running-config г) show ip interface 154. Каждый сегмент _____________________, подсоединенный к порту _____________________, может быть назначен только одной виртуальной сети. а) Коммутатора; концентратора б) Локальной сети; концентратора в) Концентратора; коммутатора г) Концентратора; маршрутизатора 155. Что из перечисленного ниже не является характерным признаком виртуальной сети? а) Приложение б) Протокол в) Все перечисленные понятия являются характерными признаками виртуальной сети г) ID-порт и МАС-адрес 156. Какая из следующих характеристик не верна для 10BaseT? а) Носитель — кабель пятой категории UTP б) Максимальная длина — 400 метров в) Скорость передачи — 10 Мбит/с г) Метод передачи сигналов — узкополосный 157. Какое из определений наилучшим образом описывает функцию коммутационной панели? а) Служит для временного решения проблем в сети б) Служит в качестве коммутатора, где кабели горизонтальной кабельной системы от рабочих станций могут соединяться с другими рабочими станциями, образуя сеть в) Служит в качестве центра сети Token Ring и управляет прохождением и освобождением маркера г) Служит в качестве концентратора для создаваемых на короткий срок сетей, часто встречающихся на съездах и шоу 158. Что из приведенного ниже неправильно описывает функцию команды статуса маршрутизатора? а) show memory выводит на экран статистические данные о памяти маршрутизатора, включая статистику свободных пулов памяти б) show buffers выводит на экран статистические данные пулов буферов маршрутизатора в) show interfaces выводит на экран статистические данные по всем интерфейсам, сконфигурированным на маршрутизаторе г) show version выводит на экран конфигурацию аппаратной части системы, имена и источники конфигурационных файлов и образы начальной загрузки 159. Какая команда вводится для того, чтобы просмотреть файл активной конфигурации маршрутизатора? а) show version б) show backup-config в) show config term г) show running-config 160. Если планируется конфигурирование интерфейса, то какой вид должна иметь командная строка маршрутизатора? Эталон ответов: а) Router(config)# б) Router(config-in)# в) Router(config-if)# г) Router(config-intf)#",
    "answers": []
  }
]